



CDNI                                                          J. Seedorf
Internet-Draft                 HFT Stuttgart - Univ. of Applied Sciences
Intended status: Standards Track                                 Y. Yang
Expires: December 20, 2018                                   Tongji/Yale
                                                                   K. Ma
                                                                Ericsson
                                                             J. Peterson
                                                                 Neustar
                                                                  X. Lin
                                                                  Tongji
                                                           June 18, 2018


 Content Delivery Network Interconnection (CDNI) Request Routing: CDNI
          Footprint and Capabilities Advertisement using ALTO
              draft-ietf-alto-cdni-request-routing-alto-03

Abstract

   The Content Delivery Networks Interconnection (CDNI) WG is defining a
   set of protocols to inter-connect CDNs, to achieve multiple goals
   such as extending the reach of a given CDN to areas that are not
   covered by that particular CDN.  One component that is needed to
   achieve the goal of CDNI is the CDNI Request Routing Footprint &
   Capabilities Advertisement interface (FCI) [RFC7336].  [RFC8008] has
   defined precisely the semantics of FCI and provided guidelines on the
   FCI protocol, but the exact protocol is explicitly outside the scope
   of that document.  In this document, we define an FCI protocol using
   the Application-Layer Traffic Optimization (ALTO) protocol.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on December 20, 2018.





Seedorf, et al.         Expires December 20, 2018               [Page 1]

Internet-Draft             CDNI FCI using ALTO                 June 2018


Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Background  . . . . . . . . . . . . . . . . . . . . . . . . .   4
     2.1.  Semantics of FCI Advertisement  . . . . . . . . . . . . .   4
     2.2.  ALTO Background and Benefits  . . . . . . . . . . . . . .   6
   3.  CDNI FCI Map  . . . . . . . . . . . . . . . . . . . . . . . .   8
     3.1.  Media Type  . . . . . . . . . . . . . . . . . . . . . . .   9
     3.2.  HTTP Method . . . . . . . . . . . . . . . . . . . . . . .   9
     3.3.  Accept Input Parameters . . . . . . . . . . . . . . . . .   9
     3.4.  Capabilities  . . . . . . . . . . . . . . . . . . . . . .   9
     3.5.  Uses  . . . . . . . . . . . . . . . . . . . . . . . . . .   9
     3.6.  Response  . . . . . . . . . . . . . . . . . . . . . . . .   9
     3.7.  Examples  . . . . . . . . . . . . . . . . . . . . . . . .  10
       3.7.1.  IRD Example . . . . . . . . . . . . . . . . . . . . .  10
       3.7.2.  Basic Example . . . . . . . . . . . . . . . . . . . .  12
       3.7.3.  Incremental Updates Example . . . . . . . . . . . . .  13
   4.  CDNI FCI Map using ALTO Network Map . . . . . . . . . . . . .  15
     4.1.  Introduce Footprint Type: altonetworkmap  . . . . . . . .  15
     4.2.  Examples  . . . . . . . . . . . . . . . . . . . . . . . .  15
       4.2.1.  IRD Example . . . . . . . . . . . . . . . . . . . . .  15
       4.2.2.  ALTO Network Map for CDNI FCI Footprints Example  . .  15
       4.2.3.  ALTO Network Map Footprints in CDNI FCI Map . . . . .  16
       4.2.4.  Incremental Updates Example . . . . . . . . . . . . .  17
   5.  Filtered CDNI FCI Map using Capabilities  . . . . . . . . . .  19
     5.1.  Media Type  . . . . . . . . . . . . . . . . . . . . . . .  19
     5.2.  HTTP Method . . . . . . . . . . . . . . . . . . . . . . .  19
     5.3.  Accept Input Parameters . . . . . . . . . . . . . . . . .  19
     5.4.  Capabilities  . . . . . . . . . . . . . . . . . . . . . .  20
     5.5.  Uses  . . . . . . . . . . . . . . . . . . . . . . . . . .  20
     5.6.  Response  . . . . . . . . . . . . . . . . . . . . . . . .  20
     5.7.  Examples  . . . . . . . . . . . . . . . . . . . . . . . .  21
       5.7.1.  IRD Example . . . . . . . . . . . . . . . . . . . . .  21



Seedorf, et al.         Expires December 20, 2018               [Page 2]

Internet-Draft             CDNI FCI using ALTO                 June 2018


       5.7.2.  Basic Example . . . . . . . . . . . . . . . . . . . .  21
       5.7.3.  Incremental Updates Example . . . . . . . . . . . . .  22
   6.  Query Footprint Properties using ALTO Unified Property
       Service . . . . . . . . . . . . . . . . . . . . . . . . . . .  24
     6.1.  Representing Footprint Objects as Unified Property Map
           Entities  . . . . . . . . . . . . . . . . . . . . . . . .  24
       6.1.1.  ASN Domain  . . . . . . . . . . . . . . . . . . . . .  25
       6.1.2.  COUNTRYCODE Domain  . . . . . . . . . . . . . . . . .  25
     6.2.  Examples  . . . . . . . . . . . . . . . . . . . . . . . .  26
       6.2.1.  IRD Example . . . . . . . . . . . . . . . . . . . . .  26
       6.2.2.  Property Map Example  . . . . . . . . . . . . . . . .  26
       6.2.3.  Filtered Property Map Example . . . . . . . . . . . .  27
       6.2.4.  Incremental Updates Example . . . . . . . . . . . . .  28
   7.  Protocol Errors . . . . . . . . . . . . . . . . . . . . . . .  30
   8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  30
     8.1.  CDNI Metadata Footprint Type Registry . . . . . . . . . .  30
     8.2.  ALTO Entity Domain Registry . . . . . . . . . . . . . . .  31
     8.3.  ALTO CDNI FCI Property Type Registry  . . . . . . . . . .  31
   9.  Security Considerations . . . . . . . . . . . . . . . . . . .  31
   10. Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  32
   11. References  . . . . . . . . . . . . . . . . . . . . . . . . .  32
     11.1.  Normative References . . . . . . . . . . . . . . . . . .  32
     11.2.  Informative References . . . . . . . . . . . . . . . . .  33
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  33

1.  Introduction

   Many Network Service Providers (NSPs) are currently considering or
   have already started to deploy Content Delivery Networks (CDNs)
   within their networks.  As a consequence of this development, there
   is a need for interconnecting these local CDNs.  Content Delivery
   Networks Interconnection (CDNI) has the goal of standardizing
   protocols to enable such interconnection of CDNs [RFC6707].

   The CDNI problem statement [RFC6707] defines four interfaces to be
   standardized within the IETF for CDN interconnection:

   o  CDNI Request Routing Interface

   o  CDNI Metadata Interface

   o  CDNI Logging Interface

   o  CDNI Control Interface

   The main purpose of the CDNI Request Routing Interface is described
   in [RFC6707] as follows: "The CDNI Request Routing interface enables
   a Request Routing function in an Upstream CDN to query a Request



Seedorf, et al.         Expires December 20, 2018               [Page 3]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   Routing function in a Downstream CDN to determine if the Downstream
   CDN is able (and willing) to accept the delegated Content Request.
   It also allows the Downstream CDN to control what should be returned
   to the User Agent in the redirection message by the upstream Request
   Routing function."  On a high level, the scope of the CDNI Request
   Routing Interface, therefore, contains two main tasks:

   o  determining if the downstream CDN (dCDN) is willing to accept a
      delegated content request;

   o  redirecting the content request coming from an upstream CDN (uCDN)
      to the proper entry point or entity in the downstream CDN.

   Correspondingly, the request routing interface is broadly divided
   into two functionalities:

   o  CDNI Footprint & Capabilities Advertisement interface (FCI): the
      advertisement from a dCDN to a uCDN or a query from a uCDN to a
      dCDN for the uCDN to decide whether to redirect particular user
      requests to that dCDN;

   o  CDNI Request Routing Redirection interface (RI): the synchronous
      operation of actually redirecting a user request.

   This document focuses solely on CDNI FCI, with a goal to specify a
   new Application-Layer Traffic Optimization (ALTO) [RFC7285] service
   called "CDNI FCI Map Service", to transport and update CDNI FCI
   objects, which are defined in a separate document in [RFC8008] and to
   describe a mechanism for filtering CDNI FCI map on capabilities or
   footprints.

   Throughout this document, we use the terminology for CDNI defined in
   [RFC6707] and [RFC8008].

2.  Background

   The design of CDNI FCI transport using ALTO depends on understanding
   of both FCI semantics and ALTO.  Hence, we start with a review of
   both.

2.1.  Semantics of FCI Advertisement

   The CDNI document on "Footprint and Capabilities Semantics" [RFC8008]
   defines the semantics for the CDNI FCI.  It thus provides guidance on
   what Footprint and Capabilities mean in a CDNI context and how a
   protocol solution should in principle look like.  The definitions in
   [RFC8008] depend on [RFC8006].  Here we briefly summarize key related




Seedorf, et al.         Expires December 20, 2018               [Page 4]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   points of [RFC8008] and [RFC8006].  For a detailed discussion, the
   reader is referred to the RFCs.

   o  Footprint and capabilities are tied together and cannot be
      interpreted independently from each other.  In such cases, i.e.
      where capabilities must be expressed on a per footprint basis, it
      may be beneficial to combine footprint and capabilities
      advertisement.  [RFC8008] integrates footprint and capabilities
      with an approach of "capabilities with footprint restrictions".

   o  Given that a large part of Footprint and Capabilities
      Advertisement will actually happen in contractual agreements, the
      semantics of CDNI Footprint and Capabilities advertisement refer
      to answering the following question: what exactly still needs to
      be advertised by the CDNI FCI?  For instance, updates about
      temporal failures of part of a footprint can be useful information
      to convey via the CDNI request routing interface.  Such
      information would provide updates on information previously agreed
      in contracts between the participating CDNs.  In other words, the
      CDNI FCI is a means for a dCDN to provide changes/updates
      regarding a footprint and/or capabilities it has prior agreed to
      serve in a contract with a uCDN.  Hence, server push and
      incremental encoding will be necessary techniques.

   o  Multiple types of footprints are defined in [RFC8006]:

      *  List of ISO Country Codes

      *  List of AS numbers

      *  Set of IP-prefixes

      A "set of IP-prefixes" must be able to contain full IP addresses,
      i.e., a /32 for IPv4 and a /128 for IPv6, and also IP prefixes
      with an arbitrary prefix length.  There must also be support for
      multiple IP address versions, i.e., IPv4 and IPv6, in such a
      footprint.

   o  For all of these mandatory-to-implement footprint types,
      footprints can be viewed as constraints for delegating requests to
      a dCDN: A dCDN footprint advertisement tells the uCDN the
      limitations for delegating a request to the dCDN.  For IP prefixes
      or ASN(s), the footprint signals to the uCDN that it should
      consider the dCDN a candidate only if the IP address of the
      request routing source falls within the prefix set (or ASN,
      respectively).  The CDNI specifications do not define how a given
      uCDN determines what address ranges are in a particular ASN.
      Similarly, for country codes, a uCDN should only consider the dCDN



Seedorf, et al.         Expires December 20, 2018               [Page 5]

Internet-Draft             CDNI FCI using ALTO                 June 2018


      a candidate if it covers the country of the request routing
      source.  The CDNI specifications do not define how a given uCDN
      determines the country of the request routing source.  Multiple
      footprint constraints are additive, i.e. the advertisement of
      different types of footprint narrows the dCDN candidacy
      cumulatively.

   o  The following capabilities are defined as "base" capabilities,
      i.e. ones that are needed in any case and therefore constitute
      mandatory capabilities to be supported by the CDNI FCI:

      *  Delivery Protocol (e.g., HTTP vs. RTMP)

      *  Acquisition Protocol (for acquiring content from a uCDN)

      *  Redirection Mode (e.g., DNS Redirection vs. HTTP Redirection as
         discussed in [RFC7336])

      *  Capabilities related to CDNI Logging (e.g., supported logging
         mechanisms)

      *  Capabilities related to CDNI Metadata (e.g., authorization
         algorithms or support for proprietary vendor metadata)

2.2.  ALTO Background and Benefits

   Application-Layer Traffic Optimization (ALTO) [RFC7285] is an
   approach for guiding the resource provider selection process in
   distributed applications that can choose among several candidate
   resources providers to retrieve a given resource.  By conveying
   network layer (topology) information, an ALTO server can provide
   important information to "guide" the resource provider selection
   process in distributed applications.  Usually, it is assumed that an
   ALTO server conveys information these applications cannot measure
   themselves [RFC5693].

   Originally, ALTO was motivated by the huge amount of cross-ISP
   traffic generated by P2P applications [RFC5693].  Recently, however,
   ALTO is also being considered for improving the request routing in
   CDNs [I-D.jenkins-alto-cdn-use-cases].  In this context, it has also
   been proposed to use ALTO for selecting an entry-point in a
   downstream NSP's network (see section 3.4 "CDN delivering Over-The-
   Top of a NSP's network" in [I-D.jenkins-alto-cdn-use-cases]).  Also,
   the CDNI problem statement explicitly mentions ALTO as a candidate
   protocol for "actual algorithms for selection of CDN or Surrogate by
   Request-Routing systems" [RFC6707].





Seedorf, et al.         Expires December 20, 2018               [Page 6]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   The following reasons make ALTO a suitable candidate protocol for
   downstream CDN selection as part of CDNI request routing and in
   particular for an FCI protocol:

   o  CDN request routing is done at the application layer.  ALTO is a
      protocol specifically designed to improve application layer
      traffic (and application layer connections among hosts on the
      Internet) by providing additional information to applications that
      these applications could not easily retrieve themselves.  For
      CDNI, this is exactly the case: a uCDN wants to improve
      application layer CDN request routing by using dedicated
      information (provided by a dCDN) that the uCDN could not easily
      obtain otherwise.

   o  The semantics of an ALTO network map are an exact match for the
      needed information to convey a footprint by a downstream CDN, in
      particular if such a footprint is being expressed by IP-prefix
      ranges.

   o  Security: ALTO maps can be signed and hence provide inherent
      integrity protection (see Section 9).

   o  RESTful-Design: The ALTO protocol has undergone extensive
      revisions in order to provide a RESTful design regarding the
      client-server interaction specified by the protocol.  A CDNI FCI
      interface based on ALTO would inherit this RESTful design.

   o  Error-handling: The ALTO protocol has undergone extensive
      revisions in order to provide sophisticated error-handling, in
      particular regarding unexpected cases.  A CDNI FCI interface based
      on ALTO would inherit this thought-through and mature error-
      handling.

   o  Filtered network map: The ALTO Map Filtering Service (see
      [RFC7285] for details) would allow a uCDN to query only for parts
      of an ALTO map.

   o  Server-initiated Notifications and Incremental Updates: In case
      the footprint or the capabilities of a downstream CDN change
      abruptly (i.e. unexpectedly from the perspective of an upstream
      CDN), server-initiated notifications would enable a dCDN to
      directly inform an upstream CDN about such changes.  Consider the
      case where - due to failure - part of the footprint of the dCDN is
      not functioning, i.e. the CDN cannot serve content to such clients
      with reasonable QoS.  Without server-initiated notifications, the
      uCDN might still use a very recent network and cost map from dCDN,
      and therefore redirect requests to dCDN which it cannot serve.
      Similarly, the possibility for incremental updates would enable



Seedorf, et al.         Expires December 20, 2018               [Page 7]

Internet-Draft             CDNI FCI using ALTO                 June 2018


      efficient conveyance of the aforementioned (or similar) status
      changes by the dCDN to the uCDN.  The newest design of ALTO
      supports server pushed incremental updates
      [I-D.ietf-alto-incr-update-sse].

   o  Content Availability on Hosts: A dCDN might want to express CDN
      capabilities in terms of certain content types (e.g. codecs/
      formats, or content from certain content providers).  The new
      endpoint property for ALTO would enable a dCDN to make such
      information available to an upstream CDN.  This would enable a
      uCDN to determine if a given dCDN actually has the capabilities
      for a given request with respect to the type of content requested.

   o  Resource Availability on Hosts or Links: The capabilities on links
      (e.g. maximum bandwidth) or caches (e.g. average load) might be
      useful information for an upstream CDN for optimized downstream
      CDN selection.  For instance, if a uCDN receives a streaming
      request for content with a certain bitrate, it needs to know if it
      is likely that a dCDN can fulfill such stringent application-level
      requirements (i.e. can be expected to have enough consistent
      bandwidth) before it redirects the request.  In general, if ALTO
      could convey such information via new endpoint properties, it
      would enable more sophisticated means for downstream CDN selection
      with ALTO.

3.  CDNI FCI Map

   The ALTO protocol is based on an ALTO Information Service Framework
   which consists of several services, where all ALTO services are
   "provided through a common transport protocol, messaging structure
   and encoding, and transaction model" [RFC7285].  The ALTO protocol
   specification [RFC7285] defines several such services, e.g. the ALTO
   map service.

   This document defines a new ALTO Map Service called "CDNI FCI Map
   Service" which conveys JSON objects of media type "application/alto-
   cdnifcimap+json".  These JSON objects are used to transport
   BaseAdvertisementObject objects defined in [RFC8008]; this document
   specifies how to transport such BaseAdvertisementObject objects via
   the ALTO protocol with the ALTO "CDNI FCI Map Service".  Given that
   the "CDNI FCI Map Service" is very similar in structure to the two
   already defined map services (network maps and cost maps), the
   specification of CDNI FCI Map below uses the same specification
   structure for Cost Map specification in Section 11.2.3 of [RFC7285]
   when specifying cost maps.






Seedorf, et al.         Expires December 20, 2018               [Page 8]

Internet-Draft             CDNI FCI using ALTO                 June 2018


3.1.  Media Type

   The media type of the CDNI FCI Map is "application/alto-
   cdnifcimap+json".

3.2.  HTTP Method

   A CDNI FCI map resource is requested using the HTTP GET method.

3.3.  Accept Input Parameters

   None.

3.4.  Capabilities

   None.

3.5.  Uses

   The resource ID of the resource based on which the CDNI FCI map will
   be defined.  For example, if a CDNI FCI map depends on a network map,
   the resource ID of the network map MUST be included in "Uses" field.
   Please see Section 4 for details.  If the CDNI FCI map does not
   depend on any other resources, "Uses" field MUST NOT appear.

3.6.  Response

   If a CDNI FCI map does not depend on other resources, the "meta"
   field of a CDNI FCI map response MUST include the "vtag" field
   defined in Section 10.3 of [RFC7285], which provides the version tag
   of the retrieved CDNI FCI map.  If a CDNI FCI map response depends on
   a resource such a network map, it MUST include the "dependent-vtags"
   field, whose value is an array to indicate the version tag of the
   resource used, where the resource is specified in "uses" of the IRD.
   The current defined dependent resource is only network map, and the
   usage of it is described in Section 4.  The data component of an ALTO
   CDNI FCI map response is named "cdni-fci-map", which is a JSON object
   of type CDNIFCIMapData:

       object {
           CDNIFCIMapData cdni-fci-map;
       } InfoResourceCDNIFCIMap : ResponseEntityBase;

       object {
           BaseAdvertisementObject capabilities<1..*>;
       } CDNIFCIMapData





Seedorf, et al.         Expires December 20, 2018               [Page 9]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   Specifically, a CDNIFCIMapData object is a JSON object, and it
   includes only one property "capabilities" and whose value is an array
   of BaseAdvertisementObject objects.  The syntax and semantics of
   BaseAdvertisementObject are well defined in Section 5.1 of [RFC8008].
   BaseAdvertisementObject object consists of capability-type,
   capability-value and footprints.  And footprints are defined in
   Section 4.2.2.2 of [RFC8006].

   The ALTO client MUST interpret footprints appearing multiple times as
   if they appeared only once.  If no footprint restriction list is
   specified (or an empty list is specified), the ALTO client MUST
   understand that all footprint types are reset to "global" coverage.

   Note: Further optimization of BaseAdvertisement objects to
   effectively provide the advertisement of capabilities with footprint
   restrictions is certainly possible, however, it is not necessary for
   the basic interconnection of CDNs.  The note here is for
   completeness, however, the specifics of such mechanisms are outside
   the scope of this document.

3.7.  Examples

3.7.1.  IRD Example

   Below is an example IRD announcing two network maps, one CDNI FCI map
   without dependency, one CDNI FCI map depending on a network map, one
   filtered CDNI FCI map, one unified property map including "cdni-fci-
   capabilities" as its entities' property, one filtered unified
   property map including "cdni-fci-capabilities" and "pid" as its
   entities' properties and two update stream services (one for updating
   CDNI FCI maps, and the other for updating property maps).

     GET /directory HTTP/1.1
     Host: alto.example.com
     Accept: application/alto-directory+json,application/alto-error+json

   {
     "meta" : { ... },
     "resources": {
       "my-default-network-map": {
         "uri" : "http://alto.example.com/networkmap",
         "media-type" : "application/alto-networkmap+json"
       },
       "my-eu-netmap" : {
         "uri" : "http://alto.example.com/myeunetmap",
         "media-type" : "application/alto-networkmap+json"
       },
       "my-default-cdnifci-map": {



Seedorf, et al.         Expires December 20, 2018              [Page 10]

Internet-Draft             CDNI FCI using ALTO                 June 2018


         "uri" : "http://alto.example.com/cdnifcimap",
         "media-type": "application/alto-cdnifcimap+json"
       },
       "my-filtered-cdnifci-map" : {
         "uri" : "http://alto.example.com/cdnifcimap/filtered",
         "media-type" : "application/alto-cdnifcimap+json",
         "accepts" : "application/alto-cdnifcimapfilter+json",
         "uses" : [ "my-default-cdnifci-map" ]
       },
       "my-cdnifci-map-with-network-map-footprints": {
         "uri" : "http://alto.example.com/networkcdnifcimap",
         "media-type" : "application/alto-cdnifcimap+json",
         "uses" : [ "my-eu-netmap" ]
       },
       "cdnifci-property-map" : {
         "uri" : "http://alto.example.com/propmap/full/cdnifci",
         "media-type" : "application/alto-propmap+json",
         "capabilities" : {
           "domain-types" : [ "ipv4", "ipv6", "coutrycode", "asn" ],
           "prop-types" : [ "cdni-fci-capabilities" ]
         }
       },
       "filtered-cdnifci-property-map" : {
         "uri" : "http://alto.example.com/propmap/lookup/cdnifci-pid",
         "media-type" : "application/alto-propmap+json",
         "accpets" : "application/alto-propmapparams+json",
         "capabilities" : {
           "domain-types" : [ "ipv4", "ipv6", "coutrycode", "asn" ],
           "prop-types" : [ "cdni-fci-capabilities", "pid" ]
          }
       },
       "update-my-cdni-fci-maps" : {
         "uri": "http:///alto.example.com/updates/cdnifcimaps",
         "media-type" : "text/event-stream",
         "accepts" : "application/alto-updatestreamparams+json",
         "uses" : [
           "my-default-network-map",
           "my-eu-netmap",
           "my-default-cdnifci-map",
           "my-filtered-cdnifci-map"
           "my-cdnifci-map-with-network-map-footprints"
         ],
         "capabilities" : {
           "incremental-change-media-types" : {
             "my-default-network-map" : "application/json-patch+json",
             "my-eu-netmap" : "application/json-patch+json",
             "my-default-cdnifci-map" :
             "application/merge-patch+json,application/json-patch+json",



Seedorf, et al.         Expires December 20, 2018              [Page 11]

Internet-Draft             CDNI FCI using ALTO                 June 2018


             "my-filtered-cdnifci-map" :
             "application/merge-patch+jso,application/json-patch+json",
             "my-cdnifci-map-with-network-map-footprints" :
             "application/merge-patch+json,application/json-patch+json"
           }
         }
       },
       "update-my-props": {
         "uri" : "http://alto.example.com/updates/properties",
         "media-type" : "text/event-stream",
         "uses" : [
           "cdnifci-property-map",
           "filtered-cdnifci-property-map"
         ],
         "capabilities" : {
           "incremental-change-media-types": {
             "cdnifci-property-map" :
             "application/merge-patch+json,application/json-patch+json",
             "filtered-cdnifci-property-map":
             "application/merge-patch+json,application/json-patch+json"
           }
         }
       }
     }
   }

3.7.2.  Basic Example

   In this example, we demonstrate a simple CDNI FCI map; this map does
   not depend on other resources.

   GET /cdnifcimap HTTP/1.1
   Host: alto.example.com
   Accept: application/alto-cdnifcimap+json,application/alto-error+json

       HTTP/1.1 200 OK
       Content-Length: XXX
       Content-Type: application/alto-cdnifcimap+json
       {
         "meta" : {
           "vtag": {
             "resource-id": "my-default-cdnifci-map",
             "tag": "da65eca2eb7a10ce8b059740b0b2e3f8eb1d4785"
           }
         },
         "cdni-fci-map": {
           "capabilities": [
             {



Seedorf, et al.         Expires December 20, 2018              [Page 12]

Internet-Draft             CDNI FCI using ALTO                 June 2018


               "capability-type": "FCI.DeliveryProtocol",
               "capability-value": {
                 "delivery-protocols": [
                   "http/1.1"
                 ]
               },
               "footprints": [
                 <Footprint objects>
               ]
             },
             {
               "capability-type": "FCI.DeliveryProtocol",
               "capability-value": {
                 "delivery-protocols": [
                   "https/1.1",
                   "http/1.1"
                 ]
               },
               "footprints": [
                 <Footprint objects>
               ]
             },
             {
               "capability-type": "FCI.AcquisitionProtocol",
               "capability-value": {
                 "acquisition-protocols": [
                   "https/1.1"
                 ]
               },
               "footprints": [
                 <Footprint objects>
               ]
             }
           ]
         }
       }

3.7.3.  Incremental Updates Example

   A benefit of using ALTO to provide CDNI FCI maps is that such maps
   can be updated using ALTO incremental updates.  Below is an example
   that also shows a benefit of using a JSON merge patch to encode a big
   update and using a JSON patch to encode a small update.

     POST /updates/cdnifcimaps HTTP/1.1
     Host: alto.example.com
     Accept: text/event-stream,application/alto-error+json
     Content-Type: application/alto-updatestreamparams+json



Seedorf, et al.         Expires December 20, 2018              [Page 13]

Internet-Draft             CDNI FCI using ALTO                 June 2018


     Content-Length: ###

     { "add": {
         "my-cdnifci-stream": {
             "resource-id": "my-default-cdnifci-map"
         }
     }

     HTTP/1.1 200 OK
     Connection: keep-alive
     Content-Type: text/event-stream

     event: application/alto-updatestreamcontrol+json
     data: {"control-uri":
     data: "http://alto.example.com/updates/streams/3141592653589"}

     event: application/alto-cdnifcimap+json,my-fci-stream
     data: { ... full CDNI FCI map ... }

     event: application/merge-patch+json,my-fci-stream
     data: {
     data:   "meta": {
     data:     "vtag": {
     data:       "tag": "dasdfa10ce8b059740bddsfasd8eb1d47853716"
     data:     }
     data:   },
     data:   {
     data:     "capability-type": "FCI.DeliveryProtocol",
     data:     "capability-value": {
     data:       "delivery-protocols": [
     data:         "http/1.1"
     data:       ]
     data:     },
     data:     "footprints": [
     data:       <Footprint objects that are different from
     data:        footprint objects in delivery-protocols http/1.1>
     data:     ]
     data:   }
     data: }

     event: application/json-patch+json,my-fci-stream
     data: [
     data:   {
     data:     "op": "replace",
     data:     "path": "/meta/vtag/tag",
     data:     "value": "a10ce8b059740b0b2e3f8eb1d4785acd42231bfe"
     data:   },
     data:   { "op": "add",



Seedorf, et al.         Expires December 20, 2018              [Page 14]

Internet-Draft             CDNI FCI using ALTO                 June 2018


     data:     "path": "/cdni-fci-map/capabilities/0/footprints/-",
     data:     "value": "ipv4:192.0.2.0/24"
     data:   }
     data: ]

4.  CDNI FCI Map using ALTO Network Map

4.1.  Introduce Footprint Type: altonetworkmap

   In addition to the already defined CDNI footprint typs (e.g.,
   ipv4cidr, ipv6cidr, asn, countrycode), ALTO network maps can be a
   type of FCI footprint.  To enable such referencing to ALTO network
   maps, a new CDNI Footprint Type "altonetworkmap" is defined (see also
   Section 8.1).

   All altonetworkmap entries MUST be of type PIDName (as defined in
   [RFC7285], where PIDName corresponds to a PID in the ALTO network map
   referenced by the resource ID of the network map listed in
   "dependent-vtags" field).

4.2.  Examples

4.2.1.  IRD Example

   We use the same IRD example given by Section 3.7.1.

4.2.2.  ALTO Network Map for CDNI FCI Footprints Example

   Below is an example network map that is referenced by the CDNI FCI
   map example in Section 4.2.3

    GET /networkmap HTTP/1.1
    Host: http://alto.example.com/myeunetmap
    Accept: application/alto-networkmap+json,application/alto-error+json

















Seedorf, et al.         Expires December 20, 2018              [Page 15]

Internet-Draft             CDNI FCI using ALTO                 June 2018


       HTTP/1.1 200 OK
       Content-Length: XXX
       Content-Type: application/alto-networkmap+json

       {
         "meta" : {
           "vtag": [
             {"resource-id": "my-eu-netmap",
              "tag": "3ee2cb7e8d63d9fab71b9b34cbf764436315542e"
             }
           ]
         },
         "network-map" : {
           "south-france" : {
             "ipv4" : [ "192.0.2.0/24", "198.51.100.0/25" ]
           },
           "germany" : {
             "ipv4" : [ "192.0.3.0/24"]
           }
         }
       }

4.2.3.  ALTO Network Map Footprints in CDNI FCI Map

   In this example, we show a CDNI FCI map that depends on a network map
   described in Section 4.2.2.

    GET /networkcdnifcimap HTTP/1.1
    Host: alto.example.com
    Accept: application/alto-cdnifcimap+json,application/alto-error+json





















Seedorf, et al.         Expires December 20, 2018              [Page 16]

Internet-Draft             CDNI FCI using ALTO                 June 2018


       HTTP/1.1 200 OK
       Content-Length: 618
       Content-Type: application/alto-cdnifcimap+json

       {
         "meta" : {
           "dependent-vtags" : [
             {
               "resource-id": "my-eu-netmap",
               "tag": "3ee2cb7e8d63d9fab71b9b34cbf764436315542e"
             }
           ]
         },
         "cdni-fci-map": {
           "capabilities": [
             { "capability-type": "FCI.DeliveryProtocol",
               "capability-value": [
                 "http/1.1"
               ]
             },
             { "capability-type": "FCI.DeliveryProtocol",
               "capability-value": [
               "values": [
                 "https/1.1"
               ],
               "footprints": [
                 { "footprint-type": "altonetworkmap",
                   "footprint-value": [
                     "germany",
                     "south-france"
                   ]
                 }
               ]
             }
           ]
         }
       }

4.2.4.  Incremental Updates Example

   In this example, the ALTO client is interested in changes of "my-
   cdnifci-map-with-network-map-footrprints".  And we present two
   patches here.  The first one of it is to change footprints of
   http/1.1 Delivery Protocol capability, and the second one is to
   remove "south-france" from the footprints of https/1.1 Delivery
   Protocol capability.

     POST /updates/cdnifcimaps HTTP/1.1



Seedorf, et al.         Expires December 20, 2018              [Page 17]

Internet-Draft             CDNI FCI using ALTO                 June 2018


     Host: alto.example.com
     Accept: text/event-stream,application/alto-error+json
     Content-Type: application/alto-updatestreamparams+json
     Content-Length: ###

     { "add": {
         "my-network-map-cdnifci-stream": {
             "resource-id": "my-cdnifci-map-with-network-map-footprints"
         }
     }

     HTTP/1.1 200 OK
     Connection: keep-alive
     Content-Type: text/event-stream

     event: application/alto-updatestreamcontrol+json
     data: {"control-uri":
     data: "http://alto.example.com/updates/streams/3141592653590"}

     event: application/alto-cdnifcimap+json,my-fci-stream
     data: { ... full CDNI FCI map ... }

     event: application/merge-patch+json,my-fci-stream
     data: {
     data:   "meta": {
     data:     "dependent-vtags" : [
     data:      {
     data:        "resource-id": "my-eu-netmap",
     data:        "tag": "3ee2cb7e8d63d9fab71b9b34cbf764436315542e"
     data:      }
     data:     ],
     data:     "vtag": {
     data:       "tag": "dasdfa10ce8b059740bddsfasd8eb1d47853716"
     data:     }
     data:   },
     data:   {
     data:     "capability-type": "FCI.DeliveryProtocol",
     data:     "capability-value": {
     data:       "delivery-protocols": [
     data:         "http/1.1"
     data:       ]
     data:     },
     data:     "footprints": [
     data:       <Footprint objects that are different from
     data:        footprint objects in delivery-protocols http/1.1>
     data:     ]
     data:   }
     data: }



Seedorf, et al.         Expires December 20, 2018              [Page 18]

Internet-Draft             CDNI FCI using ALTO                 June 2018


     event: application/json-patch+json,my-fci-stream
     data: [
     data:   {
     data:     "op": "replace",
     data:     "path": "/meta/vtag/tag",
     data:     "value": "a10ce8b059740b0b2e3f8eb1d4785acd42231bfe"
     data:   },
     data:   { "op": "remove",
     data:     "path": "/cdni-fci-map/capabilities/2/footprints/0/
     data:       footprint-value/1",
     data:   }
     data: ]

5.  Filtered CDNI FCI Map using Capabilities

   This document defines a new service named "Filtered CDNI FCI Map
   Service".  The semantic of a Filtered CDNI FCI Map is that given some
   capabilities, which footprints have at least one of these
   capabilities.  And a filtered CDNI FCI map is a CDNI FCI map for
   which an ALTO client may supply additional capabilities to limit the
   scope of the resulting CDNI FCI map.  The relationship between a
   filtered CDNI FCI map and a CDNI FCI Map is similar to the
   relationship between a filtered network/cost map and a network/cost
   map.

5.1.  Media Type

   Since a filtered CDNI FCI map is still a CDNI FCI map, it uses the
   media type defined for CDNI FCI maps at Section 3.1.

5.2.  HTTP Method

   A filtered CDNI FCI map is requested using the HTTP POST method.

5.3.  Accept Input Parameters

   The input parameters for a filtered CDNI FCI map are supplied in the
   entity body of the POST request.  This document specifies the input
   parameters with a data format indicated by the media type
   "application/alto-cdni-filter", which is a JSON object of type
   ReqFilteredCDNIFCIMap, where:










Seedorf, et al.         Expires December 20, 2018              [Page 19]

Internet-Draft             CDNI FCI using ALTO                 June 2018


      object {
          JSONString capability-type;
          JSONValue capability-value;
      } CDNIFCICapability;

      object {
          [CDNIFCICapability cdni-fci-capabilities<0..*>;]
      } ReqFilteredCDNIFCIMap;

   with fields:

   capability-type:  The same as Base Advertisement Object's capability-
      type defined in Section 5.1 of [RFC8008].

   capability-value:  The same as Base Advertisement Object's
      capability-value defined in Section 5.1 of [RFC8008].

   cdni-fci-capabilities:  A list of CDNI FCI capabilities defined in
      Section 5.1 of [RFC8008] for which footprints are to be returned.
      If a list is empty, the ALTO server MUST interpret it as a request
      for the full CDNI FCI Map. The ALTO server MUST interpret entries
      appearing in a list multiple times as if they appeared only once.
      The ALTO client SHOULD avoid the same entries appearing in "cdni-
      fci-capabilities" multiple times.  If the "cdni-fci-capabilities"
      field is not present, the ALTO server MUST interpret it as a
      request for the full CDNI FCI Map. If a "capability-type" or a
      "capability-value" is not defined, the ALTO server MUST ignore
      this capability.  If it is the only capability in the list, the
      ALTO server MUST return nothing.

5.4.  Capabilities

   None.

5.5.  Uses

   The resource ID of the CDNI FCI map based on which the filtering is
   performed.

5.6.  Response

   The format is the same as an unfiltered CDNI FCI map.  See
   Section 3.6 for the format.

   The returned CDNI FCI map MUST contain only BaseAdvertisementObject
   objects whose CDNI capability object is the superset of one of CDNI
   capability object in "cdni-fci-capabilities".  Specifically, that a
   CDNI capability object A is the superset of another CDNI capability



Seedorf, et al.         Expires December 20, 2018              [Page 20]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   object B means that these two CDNI capability objects have the same
   capability type and mandatory properties in capability value of A
   MUST include mandatory properties in capability value of B
   semantically.  For example, if a CDNI FCI capability in "cdni-fci-
   capabilities" is Delivery Protocol capability object with "http/1.1"
   in its field "delivery-protocols" and the original full CDNI FCI map
   has two CDNI FCI objects whose capabilities are Delivery Protocol
   capability objects with ["http/1.1"] and ["http/1.1", "https/1.1"] in
   their field "delivery-protocols" respectively, both of these two CDNI
   FCI objects MUST be returned.  If the input parameters contain a CDNI
   capability object that is not currently defined, the ALTO server MUST
   behave as if the CDNI capability object did not appear in the input
   parameters.

   The version tag included in the "vtag" field of the response MUST
   correspond to the full CDNI FCI map resource from which the filtered
   CDNI FCI map is provided.  This ensures that a single, canonical
   version tag is used independently of any filtering that is requested
   by an ALTO client.

5.7.  Examples

5.7.1.  IRD Example

   We use the same IRD example by Section 3.7.1.

5.7.2.  Basic Example

   This example is filtering the full CDNI FCI map example in
   Section 3.7.2.

      POST /cdnifcimap/filtered HTTP/1.1
      HOST: alto.example.com
      Content-Type: application/cdnifilter+json
      Accept: application/alto-cdnifcimap+json

      {
        "cdni-fci-capabilities": [
          {
            "capability-type": "FCI.DeliveryProtocol",
            "capability-value": {
              "delivery-protocols": [
                 "http/1.1"
              ]
            }
          }
        ]
      }



Seedorf, et al.         Expires December 20, 2018              [Page 21]

Internet-Draft             CDNI FCI using ALTO                 June 2018


       HTTP/1.1 200 OK
       Content-Length: XXX
       Content-Type: application/alto-cdnifcimap+json
       {
         "meta" : {
           "vtag": {
             "resource-id": "my-default-cdnifci-map",
             "tag": "da65eca2eb7a10ce8b059740b0b2e3f8eb1d4785"
           }
         },
         "cdni-fci-map": {
           "capabilities": [
             {
               "capability-type": "FCI.DeliveryProtocol",
               "capability-value": {
                 "delivery-protocols": [
                   "http/1.1"
                 ]
               },
               "footprints": [
                 <Footprint objects>
               ]
             },
             {
               "capability-type": "FCI.DeliveryProtocol",
               "capability-value": {
                 "delivery-protocols": [
                   "https/1.1",
                   "http/1.1"
                 ]
               },
               "footprints": [
                 <Footprint objects>
               ]
             }
           ]
         }
       }

5.7.3.  Incremental Updates Example

   In this example, the ALTO client only cares about the updates of one
   Delivery Protocol object whose value is "http/1.1".  So it adds its
   limitation of capabilities in "input" field of the POST request.

     POST /updates/cdnifcimaps HTTP/1.1
     Host: fcialtoupdate.example.com
     Accept: text/event-stream,application/alto-error+json



Seedorf, et al.         Expires December 20, 2018              [Page 22]

Internet-Draft             CDNI FCI using ALTO                 June 2018


     Content-Type: application/alto-updatestreamparams+json
     Content-Length: ###

     { "add": {
         "my-fci-stream": {
             "resource-id": "my-filtered-cdnifci-map",
             "input": {
               "cdni-fci-capabilities": [
               {
                 "capability-type": "FCI.DeliveryProtocol",
                 "capability-value": {
                   "delivery-protocols": [
                     "http/1.1"
                   ]
                 }
               }
             ]
           }
         }
       }
     }

     HTTP/1.1 200 OK
     Connection: keep-alive
     Content-Type: text/event-stream

     event: application/alto-updatestreamcontrol+json
     data: {"control-uri":
     data: "http://alto.example.com/updates/streams/3141592653590"}

     event: application/alto-cdnifcimap+json,my-fci-stream
     data: { ... full filtered CDNI FCI map ... }

     event: application/merge-patch+json,my-fci-stream
     data: {
     data:   "meta": {
     data:     "vtag": {
     data:       "tag": "dasdfa10ce8b059740bddsfasd8eb1d47853716"
     data:     }
     data:   },
     data:   {
     data:     "capability-type": "FCI.DeliveryProtocol",
     data:     "capability-value": {
     data:       "delivery-protocols": [
     data:         "http/1.1"
     data:       ]
     data:     },
     data:     "footprints": [



Seedorf, et al.         Expires December 20, 2018              [Page 23]

Internet-Draft             CDNI FCI using ALTO                 June 2018


     data:       <Footprint objects that are different from
     data:        footprint objects in delivery-protocols http/1.1>
     data:     ]
     data:   }
     data: }

     event: application/json-patch+json,my-fci-stream
     data: [
     data:   {
     data:     "op": "replace",
     data:     "path": "/meta/vtag/tag",
     data:     "value": "a10ce8b059740b0b2e3f8eb1d4785acd42231bfe"
     data:   },
     data:   { "op": "add",
     data:     "path": "/cdni-fci-map/capabilities/0/footprints/-",
     data:     "value": "ipv4:192.0.2.0/24"
     data:   }
     data: ]

6.  Query Footprint Properties using ALTO Unified Property Service

   In this section, we describe how ALTO clients look up properties for
   individual footprints.  Our design decision here is to use ALTO
   unified property map service to query footprint properties because we
   do not want to introduce extra complexity and ALTO unified property
   map defined in [I-D.ietf-alto-unified-props-new] already meets the
   requirement.  A footprint is a group of entities, and CDNI
   capabilities can be regarded as properties of a footprint.  Unified
   property map is used to provide properties for collections of
   entities such as CIDRs or PIDs.  So every footprint can be presented
   as a set of entities, and we will describe it in details in
   Section 6.1.  In addition, two resource types Property Maps and
   Filtered Property Maps are already well-defined in
   [I-D.ietf-alto-unified-props-new].

   A unified property map that includes "cdni-fci-capabilities" property
   registered in Section 8 builds the inverted index of a CDNI FCI map.
   The building process consists of two steps: firstly, each footprint
   object is represented as a set of unified property map entities in a
   domain; secondly, each unified property map entity is mapped into a
   list of property objects including CDNI capabilities.

6.1.  Representing Footprint Objects as Unified Property Map Entities

   A footprint object has two properties: footprint-type and footprint-
   value.  A footprint-value is an array of footprint values conforming
   to the specification associated with the registered footprint type
   ("ipv4cidr", "ipv6cidr", "asn", and "countrycode").  Since each



Seedorf, et al.         Expires December 20, 2018              [Page 24]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   unified property map entity has a unique address and each pair of
   footprint-type and a footprint value determines a group of unique
   addresses, a footprint object can be represented as a set of entities
   according to their different footprint-type and footprint values.
   However, [I-D.ietf-alto-unified-props-new] only defines IPv4 Domain
   and IPv6 Domain which represent footprint-type "ipv4cidr" and
   "ipv6cidr" respectively.  To represent footprint-type "asn" and
   "countrycode", this document registers two new domains in Section 8.

   Here gives an example of representing a footprint object as a set of
   unified property map entities.

   {"footprint-type": "ipv4cidr", "footprint-value": ["192.0.2.0/24",
   "198.51.100.0/24"]} --> "ipv4:192.168.2.0/24", "ipv4:198.51.100.0/24"

6.1.1.  ASN Domain

   This document specifies a new domain in addition to the ones in
   [I-D.ietf-alto-unified-props-new].  ASN is the abbreviation of
   Autonomous System Number.

6.1.1.1.  Domain Name

   asn

6.1.1.2.  Domain-Specific Entity Addresses

   The entity address of asn domain is encoded as a string consisting of
   the characters "as" (in lowercase) followed by the ASN [RFC6793].

6.1.1.3.  Hierarchy and Inheritance

   There is no hierarchy or inheritance for properties associated with
   ASN.

6.1.2.  COUNTRYCODE Domain

   This document specifies a new domain in addition to the ones in
   [I-D.ietf-alto-unified-props-new].

6.1.2.1.  Domain Name

   countrycode








Seedorf, et al.         Expires December 20, 2018              [Page 25]

Internet-Draft             CDNI FCI using ALTO                 June 2018


6.1.2.2.  Domain-Specific Entity Addresses

   The entity address of countrycode domain is encoded as an ISO 3166-1
   alpha-2 code [ISO3166-1] in lowercase.

6.1.2.3.  Hierarchy and Inheritance

   There is no hierarchy or inheritance for properties associated with
   country codes.

6.2.  Examples

6.2.1.  IRD Example

   We use the same IRD example given by Section 3.7.1.

6.2.2.  Property Map Example

   This example shows a full unified property map in which entities are
   footprints and entities' property is "cdni-fci-capabilities".

       GET /propmap/full/cdnifci HTTP/1.1
       HOST: alto.example.com
       Accept: application/alto-propmap+json,application/alto-error+json



























Seedorf, et al.         Expires December 20, 2018              [Page 26]

Internet-Draft             CDNI FCI using ALTO                 June 2018


       HTTP/1.1 200 OK
       Content-Length: ###
       Content-Type: application/alto-propmap+json

       {
         "property-map": {
           "meta": {
             "dependent-vtags": [
               {"resource-id": "my-default-cdnifci-map",
                "tag": "7915dc0290c2705481c491a2b4ffbec482b3cf62"}
             ]
           },
           "countrycode:us": {
             "cdni-fci-capabilities": [{"capability-type":,
                                            "capability-value":}]
           },
           "ipv4:192.0.2.0/24": {
             "cdni-fci-capabilities": [{"capability-type":,
                                            "capability-value":}]
           },
           "ipv4:198.51.100.0/24": {
             "cdni-fci-capabilities": [{"capability-type":,
                                            "capability-value":}]
           },
           "ipv6:2001:db8::/32": {
             "cdni-fci-capabilities": [{"capability-type":,
                                            "capability-value":}]
           },
           "asn:as64496": {
             "cdni-fci-capabilities": [{"capability-type":,
                                            "capability-value":}]
           }
         }
       }

6.2.3.  Filtered Property Map Example

   In this example, we use filtered property map service to get "pid"
   and "cdni-fci-capabilities" properties for two footprints
   "ipv4:192.0.2.0/24" and "ipv6:2001:db8::/32".











Seedorf, et al.         Expires December 20, 2018              [Page 27]

Internet-Draft             CDNI FCI using ALTO                 June 2018


      POST /propmap/lookup/cdnifci-pid HTTP/1.1
      HOST: alto.example.com
      Content-Type: application/alto-propmapparams+json
      Accept: application/alto-propmap+json,application/alto-error+json
      Content-Length:

      {
        "entities": [
          "ipv4:192.0.2.0/24",
          "ipv6:2001:db8::/32"
        ],
        "properties": [ "cdni-fci-capabilities", "pid" ]
      }

      HTTP/1.1 200 OK
      Content-Length: ###
      Content-Type: application/alto-propmap+json

      {
        "property-map": {
          "meta": {
            "dependent-vtags": [
               {"resource-id": "my-default-cdnifci-map",
                 "tag": "7915dc0290c2705481c491a2b4ffbec482b3cf62"},
               {"resource-id": "my-default-networkmap",
                 "tag": "7915dc0290c2705481c491a2b4ffbec482b3cf63"}
            ]
          },
          "ipv4:192.0.2.0/24": {
            "cdni-fci-capabilities": [{"capability-type":,
                                           "capability-value":}],
            "pid": "pid1"
          },
          "ipv6:2001:db8::/32": {
            "cdni-fci-capabilities": [{"capability-type":,
                                           "capability-value":}],
             "pid": "pid3"
          }
        }
      }

6.2.4.  Incremental Updates Example

   In this example, here is a client want to request updates for the
   properties "cdni-fci-capabilities" and "pid" for two footprints
   "ipv4:192.0.2.0/24" and "ipv6:2001:db8::/32".

      POST /updates/properties HTTP/1.1



Seedorf, et al.         Expires December 20, 2018              [Page 28]

Internet-Draft             CDNI FCI using ALTO                 June 2018


      Host: alto.example.com
      Accept: text/event-stream,application/alto-error+json
      Content-Type: application/alto-updatestreamparams+json
      Content-Length: ###

      { "add": {
        "property-map-including-capability-property": {
          "resource-id": "filtered-cdnifci-property-map",
            "input": {
              "properties": ["cdni-fci-capabilities", "pid"],
              "entities": [
                "ipv4:192.0.2.0/24",
                "ipv6:2001:db8::/32"
              ]
            }
          }
      }

      HTTP/1.1 200 OK
      Connection: keep-alive
      Content-Type: text/event-stream

      event: application/alto-updatestreamcontrol+json
      data: {"control-uri":
      data: "http://alto.example.com/updates/streams/1414213562373"}

      event: application/alto-cdnifcimap+json,my-fci-stream
      data: { ... full filtered unified property map ... }

      event: application/merge-patch+json,my-fci-stream
      data: {
      data:   "property-map":
      data:   {
      data:     "meta": {
      data:       "dependent-vtags": [
      data:         {"resource-id": "my-default-cdnifci-map",
      data:          "tag": "2beeac8ee23c3dd1e98a73fd30df80ece9fa5627"},
      data:         {"resource-id": "my-default-networkmap",
      data:          "tag": "7915dc0290c2705481c491a2b4ffbec482b3cf63"}
      data:       ]
      data:     },
      data:     "ipv4:192.0.2.0/24":
      data:     {
      data:       "cdni-fci-capabilities":
      data:         [{"capability-type":,"capability-value":}]
      data:     }
      data:   }
      data: }



Seedorf, et al.         Expires December 20, 2018              [Page 29]

Internet-Draft             CDNI FCI using ALTO                 June 2018


      event: application/json-patch+json,my-fci-stream
      data: {[
      data: {
      data:   { "op": "replace",
      data:       "path": "/meta/dependent-vtags/0/tag",
      data:       "value": "61b23185a50dc7b334577507e8f00ff8c3b409e4"
      data:   },
      data:   { "op": "replace",
      data:       "path": "/property-map/ipv4:192.0.2.0/124/",
      data:       "value": "pid5"
      data:   }
      data: }
      data: ]}

7.  Protocol Errors

   Protocol errors are handled as specified in Section 8.5 of the ALTO
   protocol [RFC7285].

   Here we explain the error-handling mechanism of filtered CDNI FCI
   map:

   o  E_SYNTAX covers all cases of syntax errors of filtered CDNI FCI
      map queries.

   o  When the syntax of queries is correct, there may be some errors in
      queries' semantics.  Such Cases can be covered by
      E_INVALID_FIELD_VALUE:

      *  The value of "capability-type" is null;

      *  The value of "capability-value" is null;

      *  The value of "capability-value" is inconsistent with
         "capability-type".

   The error-handling mechanism of query footprints is the same as the
   error-handling mechanism of ALTO Unified Property Map Service
   described in [I-D.ietf-alto-unified-props-new].

8.  IANA Considerations

8.1.  CDNI Metadata Footprint Type Registry








Seedorf, et al.         Expires December 20, 2018              [Page 30]

Internet-Draft             CDNI FCI using ALTO                 June 2018


    +-----------------+-----------------------+-----------------------+
    | Footprint Type  | Description           | Specification         |
    +-----------------+-----------------------+-----------------------+
    | altonetworkmap  | A list of PID-names   | RFCthis               |
    +-----------------+-----------------------+-----------------------+

                   Table 1: CDNI Metadata Footprint Type

   [RFC Editor: Please replace RFCthis with the published RFC number for
   this document.]

8.2.  ALTO Entity Domain Registry

   As proposed in Section 9.2 of [I-D.ietf-alto-unified-props-new],
   "ALTO Entity Domain Registry" is requested.  Besides, two new domains
   are to be registered, listed in Table 2.

   +--------------+-------------------------+--------------------------+
   | Identifier   | Entity Address Encoding | Hierarchy & Inheritance  |
   +--------------+-------------------------+--------------------------+
   | asn          | See Section 6.1.1.2     | None                     |
   | countrycode  | See Section 6.1.2.2     | None                     |
   +--------------+-------------------------+--------------------------+

                        Table 2: ALTO Entity Domain

8.3.  ALTO CDNI FCI Property Type Registry

   The "ALTO CDNI FCI Property Type Registry" is required by the ALTO
   Entity Domain "asn", "countrycode", "pid", "ipv4" and "ipv6", listed
   in Table 3.

   +------------------------+------------------------------------------+
   | Identifier             | Intended Semantics                       |
   +------------------------+------------------------------------------+
   | cdni-fci-capabilities  | An array of CDNI FCI capability objects  |
   +------------------------+------------------------------------------+

                   Table 3: ALTO CDNI FCI Property Type

9.  Security Considerations

   One important security consideration is the proper authentication of
   advertisement information provided by a downstream CDN.  The ALTO
   protocol provides a specification for a signature of ALTO information
   (see Section 15 of [RFC7285].  ALTO thus provides a proper mechanism
   for protecting the integrity of FCI information.




Seedorf, et al.         Expires December 20, 2018              [Page 31]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   More Security Considerations will be discussed in a future version of
   this document.

10.  Acknowledgments

   The authors would like to thank Kevin Ma, Daryl Malas, Matt Caulfield
   for their timely reviews and invaluable comments.

   Jan Seedorf is partially supported by the GreenICN project (GreenICN:
   Architecture and Applications of Green Information Centric
   Networking), a research project supported jointly by the European
   Commission under its 7th Framework Program (contract no. 608518) and
   the National Institute of Information and Communications Technology
   (NICT) in Japan (contract no. 167).  The views and conclusions
   contained herein are those of the authors and should not be
   interpreted as necessarily representing the official policies or
   endorsements, either expressed or implied, of the GreenICN project,
   the European Commission, or NICT.

11.  References

11.1.  Normative References

   [RFC5693]  Seedorf, J. and E. Burger, "Application-Layer Traffic
              Optimization (ALTO) Problem Statement", RFC 5693,
              DOI 10.17487/RFC5693, October 2009, <https://www.rfc-
              editor.org/info/rfc5693>.

   [RFC6707]  Niven-Jenkins, B., Le Faucheur, F., and N. Bitar, "Content
              Distribution Network Interconnection (CDNI) Problem
              Statement", RFC 6707, DOI 10.17487/RFC6707, September
              2012, <https://www.rfc-editor.org/info/rfc6707>.

   [RFC6793]  Vohra, Q. and E. Chen, "BGP Support for Four-Octet
              Autonomous System (AS) Number Space", RFC 6793,
              DOI 10.17487/RFC6793, December 2012, <https://www.rfc-
              editor.org/info/rfc6793>.

   [RFC7285]  Alimi, R., Ed., Penno, R., Ed., Yang, Y., Ed., Kiesel, S.,
              Previdi, S., Roome, W., Shalunov, S., and R. Woundy,
              "Application-Layer Traffic Optimization (ALTO) Protocol",
              RFC 7285, DOI 10.17487/RFC7285, September 2014,
              <https://www.rfc-editor.org/info/rfc7285>.

   [RFC7336]  Peterson, L., Davie, B., and R. van Brandenburg, Ed.,
              "Framework for Content Distribution Network
              Interconnection (CDNI)", RFC 7336, DOI 10.17487/RFC7336,
              August 2014, <https://www.rfc-editor.org/info/rfc7336>.



Seedorf, et al.         Expires December 20, 2018              [Page 32]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   [RFC8006]  Niven-Jenkins, B., Murray, R., Caulfield, M., and K. Ma,
              "Content Delivery Network Interconnection (CDNI)
              Metadata", RFC 8006, DOI 10.17487/RFC8006, December 2016,
              <https://www.rfc-editor.org/info/rfc8006>.

   [RFC8008]  Seedorf, J., Peterson, J., Previdi, S., van Brandenburg,
              R., and K. Ma, "Content Delivery Network Interconnection
              (CDNI) Request Routing: Footprint and Capabilities
              Semantics", RFC 8008, DOI 10.17487/RFC8008, December 2016,
              <https://www.rfc-editor.org/info/rfc8008>.

   [ISO3166-1]
              The International Organization for Standardization, "Codes
              for the representation of names of countries and their
              subdivisions -- Part 1: Country codes", ISO 3166-1:2013,
              2013.

11.2.  Informative References

   [I-D.ietf-alto-incr-update-sse]
              Roome, W. and Y. Yang, "ALTO Incremental Updates Using
              Server-Sent Events (SSE)", draft-ietf-alto-incr-update-
              sse-07 (work in progress), July 2017.

   [I-D.jenkins-alto-cdn-use-cases]
              Niven-Jenkins, B., Watson, G., Bitar, N., Medved, J., and
              S. Previdi, "Use Cases for ALTO within CDNs", draft-
              jenkins-alto-cdn-use-cases-03 (work in progress), June
              2012.

   [I-D.ietf-alto-unified-props-new]
              Roome, W. and Y. Yang, "Extensible Property Maps for the
              ALTO Protocol", draft-ietf-alto-unified-props-new-00 (work
              in progress), July 2017.

Authors' Addresses

   Jan Seedorf
   HFT Stuttgart - Univ. of Applied Sciences
   Schellingstrasse 24
   Stuttgart  70174
   Germany

   Phone: +49-0711-8926-2801
   Email: jan.seedorf@hft-stuttgart.de






Seedorf, et al.         Expires December 20, 2018              [Page 33]

Internet-Draft             CDNI FCI using ALTO                 June 2018


   Y.R. Yang
   Tongji/Yale University
   51 Prospect Street
   New Haven, CT  06511
   United States of America

   Email: yry@cs.yale.edu
   URI:   http://www.cs.yale.edu/~yry/


   Kevin J. Ma
   Ericsson
   43 Nagog Park
   Acton, MA  01720
   United States of America

   Phone: +1-978-844-5100
   Email: kevin.j.ma@ericsson.com


   Jon Peterson
   NeuStar
   1800 Sutter St Suite 570
   Concord, CA  94520
   United States of America

   Email: jon.peterson@neustar.biz


   X.S. Lin
   Tongji University
   4800 Cao'an Hwy
   Shanghai  201804
   China

   Email: x.shawn.lin@gmail.com















Seedorf, et al.         Expires December 20, 2018              [Page 34]
